In [1]:
import pandas as pd
import numpy as np

# 중복제거

In [11]:
df1 = pd.DataFrame({"k1":["one"]*3+["two"]*4,"k2":[1,1,2,3,3,4,4]})

In [12]:
df1

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

1. 데이터 프레임에서 중복된 값을 지워라

In [13]:
df1.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

2. k2 열을 기준으로 중복을 제거해라

In [14]:
df1.drop_duplicates(["k2"])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

3. 중복된 값 중 마지막으로 발견된 값을 제외하고 제거해라

In [16]:
df1.drop_duplicates(keep='last')

    k1  k2
1  one   1
2  one   2
4  two   3
6  two   4

# Na값 바꾸기

In [17]:
df2 = pd.DataFrame({"col1":[1,5,np.nan,6,7,np.nan,1,3,5,np.nan]})
df2

   col1
0   1.0
1   5.0
2   NaN
3   6.0
4   7.0
5   NaN
6   1.0
7   3.0
8   5.0
9   NaN

1. na값을 제거해라

In [18]:
df2.dropna()

   col1
0   1.0
1   5.0
3   6.0
4   7.0
6   1.0
7   3.0
8   5.0

2. na값을 0으로 치환하라(두가지 방법 존재, 가능하면 두가지다)

In [19]:
#1
df2.fillna(0)

   col1
0   1.0
1   5.0
2   0.0
3   6.0
4   7.0
5   0.0
6   1.0
7   3.0
8   5.0
9   0.0

In [25]:
#2
df2.replace(df2["col1"]>5,0)

   col1
0   1.0
1   5.0
2   NaN
3   6.0
4   7.0
5   NaN
6   1.0
7   3.0
8   5.0
9   NaN